Repository: Winstonjames2/expense_tracker_flutter
Catalog: lib/l10n/app_*.arb
Languages: my

source: About
my: အကြောင်းအရာ

# household
source: Household Record
my: အိမ်တွင်း စာရင်း

source: About Description
my: အကြောင်းအရာ ဖော်ပြချက်

source: Account
my: အကောင့်

source: Close
my: ပိတ်မည်

source: Account Details
my: အကောင့်အသေးစိတ်

# addDispatching
source: New Dispatch
my: ကားပို့ဆောင်မှုအသစ်

source: Add Transaction
my: စာရင်း ထည့်သွင်းမည်

# addTruckDispatching
source: Add Truck Dispatch
my: ကားပို့ဆောင်မှု ထည့်သွင်းမည်

source: All
my: အားလုံး

# finalBalance
source: Remaining Balance
my: ကျန်ငွေ

# totalTaken
source: Taken Amount
my: အကောင့်မှ ယူ‌ငွေ

source: Amount
my: ပမာဏ

source: App Settings
my: အက်ပ် ဆက်တင်များ

source: Cancel
my: မလုပ်တော့ပါ

source: Category
my: အမျိုးအစား

source: Change Language
my: ဘာသာစကားပြောင်းရန်

source: Choose Date
my: ရက်စွဲရွေးပါ

source: Choose Time
my: အချိန်ရွေးပါ

# currencyUnit
source: Kyats
my: ကျပ်

source: Current Balance
my: လက်ရှိငွေ

source: Date
my: ရက်စွဲ

source: Delete
my: ဖျက်မည်

# desc
source: Description
my: ဖော်ပြချက်

# description
source: Description (Optional)
my: ဖော်ပြချက် (မထည့်လည်းရ)

source: Dispatch
my: ပို့ဆောင်မှု

# dispatchDetail
source: Dispatch Details
my: ပို့ဆောင်မှု အသေးစိတ်

# dispatchNotFound
source: No Dispatch Found
my: ပို့ဆောင်မှု မတွေ့ရှိပါ

# driver
source: Driver Name (Optional)
my: ယာဉ်မောင်းအမည် (မထည့်လည်းရ)

# driverName
source: Driver
my: ယာဉ်မောင်း

source: Edit
my: ပြင်ဆင်မည်

source: Edit Transaction
my: ငွေလွှဲစာရင်း ပြင်မည်

source: Eighteen
my: တစ်ရှစ်

source: Eight
my: ရှစ်

source: Eighty
my: ရှစ်ဆယ်

source: Eleven
my: တစ်ဆယ့်တစ်

source: Expense Analytics
my: အသုံးစရိတ်ခန့်မှန်းချက်

source: Exchange Rate
my: ငွေလဲနှုန်း

source: Failed to Add Transaction
my: ငွေလွှဲစာရင်း ထည့်သွင်းခြင်း မအောင်မြင်ပါ

source: Failed to Update Changes
my: ပြင်ဆင်မှု မအောင်မြင်ပါ

source: Fifteen
my: တစ်ဆယ့်ငါး

source: Fifty
my: ငါးဆယ်

# finalRevenue
source: Final Profit
my: နောက်ဆုံးအမြတ်ငွေ

source: Five
my: ငါး

source: Font
my: စာလုံးဖောင့်

source: Forty
my: လေးဆယ်

source: Four
my: လေး

source: Fourteen
my: တစ်ဆယ့်လေး

source: Household Expenses
my: အိမ်သုံးအသုံးစရိတ်

source: Hundred
my: ရာ

source: Income
my: ၀င်ငွေ

source: Language
my: ဘာသာစကား

source: Lakh
my: သိန်း

# loadingMsg
source: Please wait...
my: ကျေးဇူးပြု၍ စောင့်ဆိုင်းပေးပါ

source: Logout
my: အကောင့်မှ ထွက်မည်

source: Million
my: သန်း

# saveData
source: Save
my: သိမ်းမည်

# totalTakenAmount
source: Taken Amount
my: ယူသောငွေပမာဏ

source: Nine
my: ကိုး

source: Nineteen
my: တစ်ဆယ့်ကိုး

source: Ninety
my: ကိုးဆယ်

source: No Changes Made
my: ပြောင်းလဲမှုမှ မရှိပါ

# noDate
source: No Date Selected
my: ရက်စွဲ မရွေးရသေးပါ

source: No More Transactions
my: နောက်ထပ်ငွေလွှဲစာရင်း မရှိတော့ပါ

source: No Time Picked
my: အချိန် မရွေးရသေးပါ

source: No Transaction Found
my: ငွေလွှဲစာရင်း မတွေ့ပါ

# numberMustBePositive
source: Amount Must Be Positive
my: ပမာဏသည် အပေါင်းဖြစ်ရမည်

source: One
my: တစ်

# outcome
source: Expense
my: ထွက်ငွေ

source: Payment Method
my: ငွေပေးချေမှု

source: Transaction Type
my: ငွေလွှဲ အမျိုးအစား

# pickedDate
source: Date
my: ရက်စွဲ

# pickedTime
source: Time
my: အချိန်

source: Please Enter Amount
my: ပမာဏ ထည့်သွင်းပါ

source: Please Select Category
my: အမျိုးအစား ရွေးချယ်ပါ

source: Please Select Payment Method
my: ငွေပေးချေမှု ရွေးချယ်ပါ

source: Please Select Payment Type
my: ငွေလွှဲ အမျိုးအစား ရွေးချယ်ပါ

source: Please Select Transaction Type
my: ငွေလွှဲ အမျိုးအစား ရွေးချယ်ပါ

source: Please Select Truck Number
my: ကားနံပါတ် ရွေးချယ်ပါ

source: Recent Transactions
my: မကြာသေးမီ ငွေလွှဲစာရင်းများ

# revenue
source: Income
my: အမြတ်ငွေ

source: Save Changes
my: ပြောင်းလဲမှုများ သိမ်းမည်

source: Seventeen
my: တစ်ဆယ့်ခုနှစ်

source: Seven
my: ခုနှစ်

source: Seventy
my: ခုနှစ်ဆယ်

source: Settings
my: ဆက်တင်များ

source: Six
my: ခြောက်

source: Sixteen
my: တစ်ဆယ့်ခြောက်

# successfullyDeletedTransaction
source: Transaction Deleted Successfully
my: ငွေလွှဲစာရင်း ဖျက်သိမ်းပြီးပါပြီ

# successfullyUpdatedChanges
source: Changes Updated Successfully
my: ပြင်ဆင်မှု အောင်မြင်သည်

source: Ten
my: တစ်ဆယ်

source: Ten Thousand
my: သောင်း

source: Thirteen
my: တစ်ဆယ့်သုံး

source: Thirty
my: သုံးဆယ်

# thisMonthDailyAverageIncome
source: This Month's Daily Average Income
my: ဤလအတွင်း နေ့စဉ်ပျမ်းမျှဝင်ငွေ

# thisMonthIncome
source: This Month's Income
my: ဤလ ဝင်ငွေ

# thisMonthOutcome
source: This Month's Expense
my: ဤလ ထွက်ငွေ

source: Thousand
my: ထောင်

source: Three
my: သုံး

source: Today
my: ယနေ့

# totalSpent
source: Total Expense
my: စုစုပေါင်းအသုံးစရိတ်

source: Theme
my: စတိုင်ပုံစံ

source: Transaction
my: ငွေလွှဲစာရင်း

source: Transaction Added Successfully
my: ငွေလွှဲစာရင်း ထည့်သွင်းပြီးပါပြီ

source: Transaction History
my: ငွေလွှဲမှတ်တမ်း

source: Transaction Not Found
my: ငွေလွှဲစာရင်း မတွေ့ပါ

source: Truck
my: ထရပ်ကား

# truckDispatch
source: Truck Dispatch List
my: ကားပို့ဆောင်မှု စာရင်း

source: Truck Expenses
my: ထရပ်ကား အသုံးစရိတ်များ

source: Truck Number
my: ထရပ်ကား နံပါတ်

source: Twelve
my: ဆယ့်နှစ်

source: Twenty
my: နှစ်ဆယ်

source: Unknown
my: မသိရ

source: View Detail
my: အသေးစိတ်ကြည့်မည်

source: Weekly Average Income
my: အပတ်စဉ်ပျမ်းမျှဝင်ငွေ

# weeklyAverageOutcome
source: Weekly Average Expense
my: အပတ်စဉ်ပျမ်းမျှထွက်ငွေ

source: Zero
my: သုည

source: Two
my: နှစ်

source: Sixty
my: ခြောက်ဆယ်

source: Expense
my: ထွက်ငွေ

# fieldRequired
source: This Field is Required
my: ကျေးဇူးပြု၍ ဤအကွက်ကို ဖြည့်ပါ

# max8Digits
source: Maximum 8 Digits Allowed
my: အများဆုံး ရှစ်လုံးသာဖြစ်ရမည်

# max10Digits
source: Maximum 10 Digits Allowed
my: အများဆုံး ၁၀လုံးသာဖြစ်ရမည်

# onlyDigits
source: Only Numeric Values Allowed
my: တန်ဖိုးသည် နံပါတ်ဖြစ်ရမည်

# max10Words
source: Maximum 10 Words Allowed
my: အများဆုံး စကားလုံး ၁၀ လုံးသာဖြစ်ရမည်

# max20Words
source: Maximum 20 Words Allowed
my: အများဆုံး စကားလုံး ၂၀ လုံးသာဖြစ်ရမည်

# maxCharacterReached
source: Maximum Character Limit Reached
my: အများဆုံး စာလုံးအရေအတွက်ကို ရောက်ရှိပြီးပါပြီ

source: Deleted Successfully
my: ဖျက်သိမ်းပြီးပါပြီ

source: Failed to Delete
my: ဖျက်သိမ်းမှု မအောင်မြင်ပါ

source: Delete Confirmation
my: ဖျက်သိမ်းမှု အတည်ပြုချက်

# areYouSureToDelete
source: Are You Sure You Want to Delete?
my: ဖျက်ရန် သေချာပါသလား

# logoutConfirmation
source: Are You Sure You Want to Logout?
my: အကောင့်မှထွက်ရန် သေချာပါသလား

source: Confirm
my: အတည်ပြုမည်

source: View List
my: စာရင်း ကြည့်မည်

# dispatchinDeleteNotice
source: Make sure you know what you're doing before deleting this.
my: ကိုယ်ဘာလုပ်နေလဲ သိမှဖျက်ပါ

source: Filter By
my: စစ်ထုတ်ခြင်း

source: Start Date
my: စတင်ရက်စွဲ

source: End Date
my: ပြီးဆုံးရက်စွဲ

# noFilterSelected
source: Please Select Filter
my: ကျေးဇူးပြု၍ ဖျက်ခြင်းအတွက်တစ်ခုရွေးပါ

source: From Date
my: မှ နေ့စွဲ

source: To Date
my: ထိ နေ့စွဲ

source: Active Dispatch
my: အလုပ်လုပ်နေသောပို့ဆောင်မှု

source: Dispatch List
my: ပို့ဆောင်မှုစာရင်း

source: Collapse
my: ချုပ်ရန်

source: Delete Transaction
my: ငွေလွှဲမှုဖျက်ရန်

# deleteTransactionConfirmation
source: Confirm to Delete Transaction
my: ငွေလွှဲမှုဖျက်ရန်အတည်ပြုပါ

# editDisplayName
source: Edit Name
my: နာမည်ပြုပြင်ရန်

# displayName
source: Name
my: နာမည်

source: Update Display Name
my: နာမည်ကို အပ်ဒိတ်လုပ်ရန်

# dispatchActive
source: Active Dispatch
my: အသုံးပြုနေသော ပို့ဆောင်မှု

# dispatchInactive
source: Inactive Dispatch
my: အသုံးမပြုနေသော ပို့ဆောင်မှု

source: Deactivate Dispatch
my: အသုံးပြုမှု သို့ပြောင်းရန်

# confirmInactivate
source: Confirm Deactivation
my: အသုံးပြုမှုရပ်မည်ကို အတည်ပြုပါ

# confirmActivate
source: Confirm Activation
my: အသုံးပြုရန် အတည်ပြုပါ

# areYouSureToInactivate
source: Are You Sure You Want to Deactivate?
my: အသုံးပြုမှုရပ်ရန် သေချာပါသလား

# areYouSureToActivate
source: Are You Sure You Want to Activate?
my: အသုံးပြုမှုဖွင့် ရန် သေချာပါသလား

source: Model Settings
my: မော်ဒယ်ဆက်တင်များ

source: Privacy Policy
my: ကိုယ်ရေးအချက်အလက် မူဝါဒ

# privacyPolicyContent
source: Your data is stored securely and never shared with third parties. We use analytics to improve the app experience. No personal data is sold or misused. For more information, please visit our website.
my: သင့်ဒေတာကို လုံခြုံစွာသိမ်းဆည်းထားပြီး တတိယသူများနှင့် မမျှဝေပါ။ အက်ပ်အသုံးပြုမှုအတွေ့အကြုံတိုးတက်အောင် analytics များကိုသာ အသုံးပြုပါသည်။ သင်၏ကိုယ်ရေးအချက်အလက်ကို မရောင်းချပါ၊ မဆိုးရွားစွာအသုံးပြုပါ။ ပိုမိုသိရှိလိုပါက ကျွန်ုပ်တို့၏ website သို့ ဝင်ရောက်ကြည့်ရှုပါ။

source: Contact Support
my: အကူအညီအတွက် ဆက်သွယ်ရန်

# contactSupportMessage
source: For help or support, please contact us at: support@finager.app
my: အကူအညီလိုအပ်ပါက ကျေးဇူးပြု၍ ဆက်သွယ်ပါ: support@finager.app

source: Confirm Refresh
my: အသစ်ပြန်လည်ဖတ်ရှုရန်အတည်ပြုမည်

# confirmRefreshMsg
source: Do you want to refresh all model data? This will take some time.
my: မော်ဒယ်ဒေတာအားလုံးကို ပြန်လည်ဖတ်ရှုရန် သေချာပါသလား? အချိန်အနည်းငယ်ကြာနိုင်ပါသည်။

source: Refresh
my: ပြန်လည်ဖတ်ရှုမည်

# successRefreshMsg
source: All model data refreshed successfully.
my: မော်ဒယ်ဒေတာအားလုံးကို အောင်မြင်စွာ ပြန်လည်ဖတ်ရှုပြီးပါပြီ။

# refreshTip
source: Refresh All Model Data
my: မော်ဒယ်ဒေတာအားလုံး ပြန်လည်ဖတ်ရှုရန်

source: Category Detail
my: အမျိုးအစားအသေးစိတ်

source: Category Name
my: အမျိုးအစားအမည်

source: House Expense
my: အိမ်သုံးအသုံးစရိတ်

source: English
my: အင်္ဂလိပ်

source: Chinese
my: တရုတ်

source: Myanmar
my: မြန်မာ

# errEngRequired
source: English Category Name is required.
my: အင်္ဂလိပ်အမျိုးအစားအမည်ဖြည့်ရန် လိုအပ်ပါသည်။

# errMinTransRequired
source: At least one translation is required.
my: ဘာသာပြန်ချက်အနည်းဆုံးတစ်ခုတော့ဖြည့်ရန် လိုအပ်ပါသည်။

source: Error
my: အမှား

source: Save
my: သိမ်းမည်

source: Payment Method Detail
my: ငွေပေးချေမှုနည်းလမ်းအသေးစိတ်

source: Add Payment Method
my: ငွေပေးချေမှုနည်းလမ်းထည့်ရန်

source: Truck Detail
my: ကားအသေးစိတ်

source: Color
my: အရောင်

source: Truck Type
my: ကားအမျိုးအစား

source: License Expiry Date
my: လိုင်စင်ကုန်ဆုံးသည့်ရက်

source: Add Truck
my: ကားအသစ်ထည့်ရန်

source: Select Date
my: ရက်စွဲရွေးချယ်ပါ

# errTruckModelRequiredFields
source: Truck Number, GPS IMEI, and License Exp Date are required.
my: ကားနံပါတ်၊ GPS IMEI နှင့်လိုင်စင်ကုန်ဆုံးသည့်ရက်သည် မဖြစ်မနေလိုအပ်သည်။

source: Success
my: အောင်မြင်ပါသည်

source: Yes
my: မှန်ပါသည်

source: No
my: မဟုတ်ပါ
